app/controllers/templates_controller.rb

SELECT "templates".* FROM "templates"
---
  def index
    @templates = Template.all

INSERT INTO "templates" ("name", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["content", ""], ["created_at", "2015-08-01 14:22:10.181538"], ["updated_at", "2015-08-01 14:22:10.181538"]]
---
  def create
    @template = Template.new(template_params)

    respond_to do |format|
      if @template.save

UPDATE "templates" SET "name" = $1, "updated_at" = $2 WHERE "templates"."id" = $3  [["name", "2"], ["updated_at", "2015-08-01 19:14:10.763555"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @template.update(template_params)

DELETE FROM "templates" WHERE "templates"."id" = $1  [["id", 1]]
---
  def destroy
    @template.destroy

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT 1  [["id", 9]]
---
    def set_template
      @template = Template.find(params[:id])